package Ch02;

/*
컴퓨터는 구조상 덧셈 연산을 할 수 있다.
컴퓨터는 구조상 뺄셈 연산을 할 수 없다.
10000000(2진수) = -128

		//문제
	//음수값임을 고려하여 풉니다
	//10 진수 	-> 2진수
	//111 		-> 01101111
	//-111 		-> 10010001
	//96		-> 01100000
	//-96		-> 10100000
	//31 		-> 00011111
	//-31		-> 11100001
	
	//2진수		-> 10진수
	//10101111 	-> -128 + 32 + 8 + 4 + 2 + 1 = -81
	//00110101	-> 32 + 16 + 4 + 1 = 53
	//11001100	-> -128 + 64 + 8 + 4 = -52
	//10101010	-> -128 + 32 + 8 + 2 = -86
 */

public class C02음수 {

	public static void main(String[] args) {
				
	}
	
}
